import vk_api
import os
import colorama
from colorama import Fore,Back,Style
colorama.init()

priva = [
"""
─██████████████─██████████████─██████████████─██████─────────██████──██████─██████──████████─
─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██─██░░██─────────██░░██──██░░██─██░░██──██░░░░██─
─██████░░██████─██░░██████░░██─██░░██████░░██─██░░██─────────██░░██──██░░██─██░░██──██░░████─
\033[32m─────██░░██─────██░░██──██░░██─██░░██──██░░██─██░░██─────────██░░██──██░░██─██░░██──██░░██───
─────██░░██─────██░░██──██░░██─██░░██──██░░██─██░░██─────────██░░██──██░░██─██░░██████░░██───
─────██░░██─────██░░██──██░░██─██░░██──██░░██─██░░██─────────██░░██──██░░██─██░░░░░░░░░░██───
─────██░░██─────██░░██──██░░██─██░░██──██░░██─██░░██─────────██░░██──██░░██─██░░██████░░██───
─────██░░██─────██░░██──██░░██─██░░██──██░░██─██░░██─────────██░░░░██░░░░██─██░░██──██░░██───
─────██░░██─────██░░██████░░██─██░░██████░░██─██░░██████████─████░░░░░░████─██░░██──██░░████─
─────██░░██─────██░░░░░░░░░░██─██░░░░░░░░░░██─██░░░░░░░░░░██───████░░████───██░░██──██░░░░██─
─────██████─────██████████████─██████████████─██████████████─────██████─────██████──████████─
─────────────────────────────────────────────────────────────────────────────────────────────
  
                                           \033[33mСоздатель: @chmotie
                                           Группа: @scripts_xxx
                                           Version: 0.1                             
  
\033[35m1)Накрутка комментов
2)Накрутка постов
3)Накрутка смс
4)Рассылка всем друзьям \033[036m!!NEW!!
\033[35m5)Авто-Статус
6)Накрутка фотографий
"""
]
print(priva[0])
vibor = input("->")
if vibor == "1":
	os.chdir("VkComments")
	os.system("cls")
	os.system("python Coms.py")
elif vibor == "2":
	os.chdir("VkPosts")
	os.system("cls")
	os.system("python posts.py")
elif vibor == "3":
	os.chdir("VkSms")
	os.system("cls")
	os.system("python sms.py")
elif vibor == "4":
	os.chdir("VkRassilka")
	os.system("cls")
	os.system("python main.py")
elif vibor == "5":
	os.chdir("VkAutoStatus")
	os.system("cls")
	os.system("python main.py")
elif vibor == "6":
	os.chdir("VkPhoto")
	os.system("cls")
	os.system("bash fix.sh")
	os.system("cls")
	os.systen("python main.py")
else:
	print("\033[31m[!]\033[37mНеверная опция")